---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir2NoSpacing
source: html/9850f8c8-ab43-5363-060d-8f6d0a651980.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir2NoSpacing Property

"Top/Exterior Minor (Brief)"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryTopDir2NoSpacing { get; }
```